# IFC_GetSpaceParamFO

## Description
Gets the space type, name or number

```pascal
FUNCTION IFC_GetSpaceParamFO(
				hSpace           : HANDLE;
				inStrParam       : STRING;
				VAR outStrResult : STRING) : BOOLEAN;
```

```python

def vs.IFC_GetSpaceParamFO(hSpace, inStrParam):
    return (BOOLEAN, outStrResult)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSpace|HANDLE||
|inStrParam|STRING||
|outStrResult|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC